In [2]:
from faker import Faker
import pandas as pd
import numpy as np
import plotly.express as px
import plotly.graph_objects as go
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
%matplotlib inline

# Here i am making the all 3 attempts matrix

In [4]:
sets_questions = []
for t in [1,2]:
    for s in [1,2,3,4]:
        for q in [1,2,3,4,5,6]:
            sets_questions.append("TA{}SA{}QA{}".format(t,s,q)) 
sets_questions.insert(0,"User_Name")

In [5]:
sets_question = []
for t in [1,2]:
    for s in [1,2,3,4]:
        for q in [1,2,3,4,5,6]:
            sets_question.append("TB{}SB{}QB{}".format(t,s,q)) 
sets_question.insert(0,"User_Name")

In [6]:
sets_question_ = []
for t in [1,2]:
    for s in [1,2,3,4]:
        for q in [1,2,3,4,5,6]:
            sets_question_.append("TC{}SC{}QC{}".format(t,s,q)) 
sets_question_.insert(0,"User_Name")

## Defing the datafames for each attempt

In [7]:
first_attempt_df = pd.DataFrame(columns=sets_questions)
second_attempt_df = pd.DataFrame(columns=sets_question)
third_attempt_df = pd.DataFrame(columns=sets_question_)

## Creating fake Users and adding them to the 3 attempts matrix

In [8]:
fake_names = Faker('en_IN')
Faker.seed(4321)

In [9]:
names = []
for _ in range(1200):
    names.append(fake_names.name())

names = list(set(names))

In [10]:
first_attempt_ans= np.random.randint(low=0, high=2, size=(len(names), (len(sets_questions)-1)))

In [11]:
second_attempt_ans= np.random.randint(low=0, high=2, size=(len(names), (len(sets_question)-1)))

In [12]:
third_attempt_ans= np.random.randint(low=0, high=2, size=(len(names), (len(sets_question_)-1)))

In [13]:
first_attempt_df['User_Name']=names 
second_attempt_df['User_Name']=names
third_attempt_df['User_Name']=names

In [14]:
first_attempt_df.iloc[:,1:] = first_attempt_ans

In [15]:
second_attempt_df.iloc[:,1:] = second_attempt_ans

In [16]:
third_attempt_df.iloc[:,1:] = third_attempt_ans

# All three attempts dataframe is ready

In [17]:
first_attempt_df.head()

,User_Name,TA1SA1QA1,TA1SA1QA2,TA1SA1QA3,TA1SA1QA4,TA1SA1QA5,TA1SA1QA6,TA1SA2QA1,TA1SA2QA2,TA1SA2QA3,...,TA2SA3QA3,TA2SA3QA4,TA2SA3QA5,TA2SA3QA6,TA2SA4QA1,TA2SA4QA2,TA2SA4QA3,TA2SA4QA4,TA2SA4QA5,TA2SA4QA6
0,Rohan Garg,0,1,1,0,0,0,1,1,1,...,0,1,0,0,0,1,1,1,0,0
1,Taran Issac,1,0,1,0,0,0,0,1,1,...,0,0,1,1,0,1,1,0,1,1
2,Jayant Sarma,1,0,1,0,1,0,0,1,1,...,0,1,1,0,0,1,0,0,1,0
3,Krish Khalsa,0,0,0,0,1,0,1,1,0,...,1,1,1,0,1,0,0,0,0,1
4,Veer Swamy,0,0,0,0,0,0,0,1,0,...,0,1,1,0,0,0,0,0,0,1

In [18]:
second_attempt_df.head()

,User_Name,TB1SB1QB1,TB1SB1QB2,TB1SB1QB3,TB1SB1QB4,TB1SB1QB5,TB1SB1QB6,TB1SB2QB1,TB1SB2QB2,TB1SB2QB3,...,TB2SB3QB3,TB2SB3QB4,TB2SB3QB5,TB2SB3QB6,TB2SB4QB1,TB2SB4QB2,TB2SB4QB3,TB2SB4QB4,TB2SB4QB5,TB2SB4QB6
0,Rohan Garg,0,0,0,0,0,1,0,1,1,...,1,1,1,0,1,0,0,1,1,1
1,Taran Issac,1,0,1,0,0,0,0,0,1,...,0,0,1,1,0,1,1,1,0,0
2,Jayant Sarma,1,0,1,0,1,0,1,1,1,...,0,1,0,0,1,0,0,0,0,0
3,Krish Khalsa,1,1,0,0,0,0,1,0,0,...,0,0,1,1,0,1,0,1,0,0
4,Veer Swamy,0,1,1,1,0,0,1,0,1,...,0,0,0,1,0,1,1,0,1,0

In [19]:
third_attempt_df.head()

,User_Name,TC1SC1QC1,TC1SC1QC2,TC1SC1QC3,TC1SC1QC4,TC1SC1QC5,TC1SC1QC6,TC1SC2QC1,TC1SC2QC2,TC1SC2QC3,...,TC2SC3QC3,TC2SC3QC4,TC2SC3QC5,TC2SC3QC6,TC2SC4QC1,TC2SC4QC2,TC2SC4QC3,TC2SC4QC4,TC2SC4QC5,TC2SC4QC6
0,Rohan Garg,0,1,1,1,1,0,0,1,0,...,0,1,1,1,1,1,0,0,0,1
1,Taran Issac,0,1,1,0,1,1,0,0,0,...,1,0,0,0,0,0,0,0,0,1
2,Jayant Sarma,1,0,1,0,1,0,1,0,0,...,1,0,1,1,0,0,1,0,0,0
3,Krish Khalsa,0,1,0,0,1,1,0,0,0,...,1,0,0,1,0,0,0,0,1,0
4,Veer Swamy,1,0,0,1,0,0,0,1,1,...,0,1,1,1,0,1,1,0,1,1

## Merging the different attempts dataframe into a final_dataframe

In [20]:
df=pd.merge(first_attempt_df,second_attempt_df, on='User_Name')
df

,User_Name,TA1SA1QA1,TA1SA1QA2,TA1SA1QA3,TA1SA1QA4,TA1SA1QA5,TA1SA1QA6,TA1SA2QA1,TA1SA2QA2,TA1SA2QA3,...,TB2SB3QB3,TB2SB3QB4,TB2SB3QB5,TB2SB3QB6,TB2SB4QB1,TB2SB4QB2,TB2SB4QB3,TB2SB4QB4,TB2SB4QB5,TB2SB4QB6
0,Rohan Garg,0,1,1,0,0,0,1,1,1,...,1,1,1,0,1,0,0,1,1,1
1,Taran Issac,1,0,1,0,0,0,0,1,1,...,0,0,1,1,0,1,1,1,0,0
2,Jayant Sarma,1,0,1,0,1,0,0,1,1,...,0,1,0,0,1,0,0,0,0,0
3,Krish Khalsa,0,0,0,0,1,0,1,1,0,...,0,0,1,1,0,1,0,1,0,0
4,Veer Swamy,0,0,0,0,0,0,0,1,0,...,0,0,0,1,0,1,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1190,Zaina Agrawal,1,0,0,0,0,0,0,1,0,...,0,0,1,0,0,1,1,1,1,1
1191,Aayush Thakkar,1,0,1,1,1,1,0,1,0,...,0,1,0,0,1,1,1,0,0,0
1192,Parinaaz Mander,1,0,0,0,0,0,0,1,1,...,1,1,1,0,0,0,0,0,1,0
1193,Hunar Bali,1,0,0,0,1,0,0,0,0,...,1,0,0,1,0,0,1,1,0,0
1194,Seher Kashyap,1,0,1,1,0,1,0,0,0,...,1,0,1,0,1,0,1,1,1,1

In [21]:
df_final=pd.merge(df,third_attempt_df, on='User_Name')

# GOT THE FINAL_DATAFRAME

In [22]:
df_final

,User_Name,TA1SA1QA1,TA1SA1QA2,TA1SA1QA3,TA1SA1QA4,TA1SA1QA5,TA1SA1QA6,TA1SA2QA1,TA1SA2QA2,TA1SA2QA3,...,TC2SC3QC3,TC2SC3QC4,TC2SC3QC5,TC2SC3QC6,TC2SC4QC1,TC2SC4QC2,TC2SC4QC3,TC2SC4QC4,TC2SC4QC5,TC2SC4QC6
0,Rohan Garg,0,1,1,0,0,0,1,1,1,...,0,1,1,1,1,1,0,0,0,1
1,Taran Issac,1,0,1,0,0,0,0,1,1,...,1,0,0,0,0,0,0,0,0,1
2,Jayant Sarma,1,0,1,0,1,0,0,1,1,...,1,0,1,1,0,0,1,0,0,0
3,Krish Khalsa,0,0,0,0,1,0,1,1,0,...,1,0,0,1,0,0,0,0,1,0
4,Veer Swamy,0,0,0,0,0,0,0,1,0,...,0,1,1,1,0,1,1,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1190,Zaina Agrawal,1,0,0,0,0,0,0,1,0,...,0,1,0,1,0,0,1,0,1,0
1191,Aayush Thakkar,1,0,1,1,1,1,0,1,0,...,1,0,1,0,1,1,0,0,1,1
1192,Parinaaz Mander,1,0,0,0,0,0,0,1,1,...,0,0,1,0,0,0,1,0,1,0
1193,Hunar Bali,1,0,0,0,1,0,0,0,0,...,0,1,1,1,0,1,1,0,1,1
1194,Seher Kashyap,1,0,1,1,0,1,0,0,0,...,1,1,1,1,1,0,1,0,0,0

## exporting the final_dataframe

In [23]:
df_final.to_csv('all 3_times attempts_made_by_users.csv')